// ----------------------------------------------------------------
// Copyright ©2022 ZhaiFanhua All Rights Reserved.
// FileName:Rule
// Guid:5c7ad5a7-2239-4327-b82f-f14df6fb1f69
// Author:zhaifanhua
// Email:me@zhaifanhua.com
// CreatTime:2022-05-02 上午 08:22:01
// ----------------------------------------------------------------

namespace TwoColorBall.Main;

/// <summary>
/// 游戏规则
/// </summary>
public class Rule
{
    /// <summary>
    /// 开始
    /// </summary>
    public void Start()
    {
        Console.ForegroundColor = ConsoleColor.Cyan;
        Console.WriteLine(@"一、玩法及说明
            双色球投注区分为红球号码区和蓝球号码区，红球号码范围为01～33，蓝球号码范围为01～16。双色球每期从33个红球中
            开出6个号码，从16个蓝球中开出1个号码作为中奖号码，双色球玩法即是竞猜开奖号码的6个红球号码和1个蓝球号码，顺
            序不限。");
        Console.WriteLine(@"二、设奖及中奖
            |------|-----------|--------|-----------------------------------------------------------------|--------|
            |      | 中奖条件  |        |                                                                 |        |
            | 奖级 |-----------|中奖说明|                          单注奖金                               |单注赔率|
            |      | 红球 |蓝球|        |                                                                 |        |
            |------|------|----|--------|-----------------------------------------------------------------|--------|
            |      |      |    |        |当奖池资金低于1亿元时，奖金总额为当期高等奖奖金的75%与奖池中累积 |        |
            |      |      |    |        |的奖金之和，单注奖金按注均分，单注最高限额封顶1000万元。         |        |
            |      |      |    |        |当奖池资金高于1亿元(含)时，奖金总额包括两部分，一部分为当期高等奖|        |
            |一等奖|RRRRRR| B  | 中6+1  |奖金的55%与奖池中累积的奖金之和，单注奖金按注均分，单注最高限额封|  ——  |
            |      |      |    |        |顶1000万元;另一部分为当期高等奖奖金的20%，单注奖金按注均分，单注 |        |
            |      |      |    |        |最高限额封顶1000万元。                                           |        |
            |------|------|----|--------|-----------------------------------------------------------------|--------|
            |二等奖|RRRRRR|    | 中6+0  |            当期高等奖奖金的25%，单注最高限额封顶500万元。       |  ——  |
            |------|------|----|--------|-----------------------------------------------------------------|--------|
            |三等奖|RRRRR | B  | 中5+1  |                   单注奖金额固定为3000元                        | 1:1500 |
            |------|------|----|--------|-----------------------------------------------------------------|--------|
            |      |RRRRR |    | 中5+0  |                                                                 |        |
            |四等奖|------|----|--------|                   单注奖金额固定为200元                         | 1:100  |
            |      |RRRRR | B  | 中4+1  |                                                                 |        |
            |------|------|----|--------|-----------------------------------------------------------------|--------|
            |      |RRRR  |    | 中4+0  |                                                                 |        |
            |五等奖|------|----|--------|                   单注奖金额固定为10元                          | 1:5    |
            |      |RRR   | B  | 中3+1  |                                                                 |        |
            |------|------|----|--------|-----------------------------------------------------------------|--------|
            |      |RR    | B  | 中2+0  |                                                                 |        |
            |      |------|----|--------|                                                                 |        |
            |六等奖|R     | B  | 中1+1  |                    单注奖金额固定为5元                          | 1:2.5  |
            |      |------|----|--------|                                                                 |        |
            |      |      | B  | 中0+1  |                                                                 |        |
            |------|------|----|--------|-----------------------------------------------------------------|--------|");
        Console.WriteLine(@"注：
            1、高等奖奖金＝奖金总额－固定奖奖金。
            2、当奖池奖金超过1亿元(含)时，下期一等奖奖金总额包括两部分，一部分为高等奖奖金的55 % 与奖池奖金之和，单注
            奖金按注均分，封顶500万元；另一部分为高等奖奖金的20 %，单注奖金按注均分，封顶1000万元。
            3、奖池奖金在1亿元以下时，单注奖金封顶1000万元。");
        Console.ResetColor();
        Console.WriteLine("你已查看完双色球规则!\n");
    }
}